docs/elementaryOS/elementaryOS_startup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-12 Mon 22:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>elementary OS Setting up Hangul Input guide.</title>
<meta name="author" content="Taylor Shin" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">elementary OS Setting up Hangul Input guide.</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7bfa466">1. Things to do after installing elementary OS.</a></li>
<li><a href="#org1fc5622">2. Some optional stuffs.</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7bfa466" class="outline-2">
<h2 id="org7bfa466"><span class="section-number-2">1</span> Things to do after installing elementary OS.</h2>
<div class="outline-text-2" id="text-1">
<p>
This walkthrough adopted  <a href="https://averagelinuxuser.com/after-install-elementary-juno/">15 Things to do after installing elementary OS</a> guide. But I&rsquo;ve added and removed some aspects to fit my need. Such as not uninstalling the default browser which I am not very dislike of it due to clean interface and baseline functionality.
</p>

<p>
This org file will get tangled into the same named shell script file without she-bang header.
</p>

<ol class="org-ol">
<li><p>
Enable repo
</p>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #b58900; font-style: italic;">sudo</span> apt install software-properties-common
</pre>
</div></li>

<li><p>
Install tweak
</p>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #b58900; font-style: italic;">sudo</span> add-apt-repository ppa:philip.scott/elementary-tweaks
    <span style="color: #b58900; font-style: italic;">sudo</span> apt update
    <span style="color: #b58900; font-style: italic;">sudo</span> apt install elementary-tweaks
</pre>
</div></li>

<li>Disable single click
Use Tweaks -&gt; Files -&gt; Single click</li>

<li>Enable good window top bar buttons!
Use Tweaks -&gt; Appearance -&gt; Layout -&gt; OS X</li>

<li><p>
Install multimedia codecs
</p>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #b58900; font-style: italic;">sudo</span> apt install ubuntu-restricted-extras libavccodec-extra libdvd-pkg
</pre>
</div></li>

<li>Activate Night Light
Settings -&gt; Displays -&gt; Night Light</li>

<li><p>
Install Drivers
</p>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #b58900; font-style: italic;">sudo</span> ubuntu-drivers autoinstall
</pre>
</div></li>

<li><p>
Enable tray icons for third party apps
This part is a bit tricky. You need to edit an xdg system file. Then install some &rsquo;old&rsquo; launcher. Then, prevent some other file to run applet. Also, you need to log out then log in back to see if it&rsquo;s actually applied.
</p>

<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #b58900; font-style: italic;">sudo</span> sed -i <span style="color: #2aa198;">\</span>
        <span style="color: #2aa198;">'s/OnlyShowIn\=Unity\;GNOME\;/OnlyShowIn\=Unity\;GNOME\;Pantheon\;/'</span> <span style="color: #2aa198;">\</span>
        /etc/xdg/autostart/indicator-application.desktop
    wget <span style="color: #2aa198;">\</span>
        http://ppa.launchpad.net/elementary-os/stable/ubuntu/pool/main/w/wingpanel-indicator-ayatana/wingpanel-indicator-ayatana_2.0.3+r27+pkg17~ubuntu0.4.1.1_amd64.deb
    <span style="color: #b58900; font-style: italic;">sudo</span> dpkg -i <span style="color: #2aa198;">\</span>
        ./wingpanel-indicator-ayatana_2.0.3+r27+pkg17~ubuntu0.4.1.1_amd64.deb
    <span style="color: #b58900; font-style: italic;">sudo</span> <span style="color: #b58900; font-style: italic;">mv</span> /etc/xdg/autostart/nm-applet.desktop <span style="color: #2aa198;">\</span>
        /etc/xdg/autostart/nm-applet.desktop.old
    <span style="color: #b58900; font-style: italic;">rm</span> -rf <span style="color: #2aa198;">\</span>
        ./wingpanel-indicator-ayatana_2.0.3+r27+pkg17~ubuntu0.4.1.1_amd64.deb
</pre>
</div></li>

<li><p>
Install Synaptic Package Manager
The defualt software center doesn&rsquo;t even have anything but their own selection. But you can use Ubuntu package sources since the distribution is based on Ubuntu 18.04. So, why not install Synaptic?
</p>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #b58900; font-style: italic;">sudo</span> apt install synaptic
</pre>
</div></li>

<li>Install Hangul Input Method
<ul class="org-ul">
<li>Refer <a href="elementaryOS_hangul_input.html">Hangul input method install instruction for elementary OS</a></li>
</ul></li>
</ol>
</div>
</div>


<div id="outline-container-org1fc5622" class="outline-2">
<h2 id="org1fc5622"><span class="section-number-2">2</span> Some optional stuffs.</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><p>
Install Firefox
</p>

<p>
Yeah, it&rsquo;s good to have a &rsquo;modern&rsquo; and super functional browser. Some people hate Epiphany. But I disagree. In fact, all of Gnome apps aren&rsquo;t that bad as other people say. They are just minimal and simple. Why they praise Apple being minimal (even calls it &rsquo;minimalism&rsquo;: an impromptu stupid word.) but blame Gnome to be minimal?
</p>

<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #b58900; font-style: italic;">sudo</span> apt install firefox
</pre>
</div></li>

<li><p>
Install LibreOffice
</p>

<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #b58900; font-style: italic;">sudo</span> apt install libreoffice libreoffice-gtk3 libreoffice-style-elementary
</pre>
</div>
<ul class="org-ul">
<li>Do not forget to set icon style to Elementary in Libreoffice options
Tools -&gt; Options -&gt; View -&gt; Icon style</li>
</ul></li>

<li><p>
Install Clipped
This command actually does not work. Just search &rsquo;clipped&rsquo; at the elementary OS&rsquo; AppCenter.
</p>

<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #b58900; font-style: italic;">sudo</span> apt install com.github.devidmhewitt.clipped
</pre>
</div>
<ul class="org-ul">
<li>Also make shortcut for it
Settings -&gt; Keyboard -&gt; Shortcuts (Make any key you want!)</li>
</ul></li>

<li><p>
Install GDebi
</p>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #b58900; font-style: italic;">sudo</span> apt install gdebi
</pre>
</div></li>

<li><p>
If laptop, install some TLP packages
Those packages reduces the number of background processes to save more battery life.
</p>

<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #b58900; font-style: italic;">sudo</span> apt install tlp tlp-rdw
</pre>
</div></li>

<li>Install Emacs, no Doomemacs!
<ul class="org-ul">
<li>Refer <a href="elementaryOS_running_emacs.html">Doomemacs install instruction on elementary OS</a></li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Taylor Shin</p>
<p class="date">Created: 2021-04-12 Mon 22:24</p>
</div>
</body>
</html>
